Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Append Method (Polycurve)
 Appends another polycurve to the geometry list
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder Append(
	Polycurve otherPolycurve
)
Public Function Append (
	otherPolycurve As Polycurve
) As PolycurveGeometryBuilder
Parameters
otherPolycurve
Type: Tekla.Structures.Geometry3d.Polycurve
Polycurve to add to the list
Return Value
Type: PolycurveGeometryBuilder
The builder itself
See Also
Reference
PolycurveGeometryBuilder Class
Append Overload
Tekla.Structures.Geometry3d Namespace